package edu.twt.rehuixiangshudong.zoo.constant;


public class MessageConstant {
    public static final String NOT_LOGIN = "NOT_LOGIN";
    public static final String LOGIN_FAILED = "用户名或密码错误！";
    public static final String ACCOUNT_NOTFOUND = "用户名不存在！";

    public static final String ACCOUNT_EXISTS = "用户名已存在！";
    public static final String REGISTER_FAILED = "注册失败！用户名过长或密码过长！";
    public static final String USER_AGREEMENT = """
            用户协议
                        
            请你务必审慎阅读、充分理解协议中相关条款内容，特别是粗体标注的内容。你一旦注册回响树洞，即视为你已了解并完全同意本协议各项内容，包括回响树洞对使用协议随时所做的任何修改。如你不同意本协议及/或随时对其的修改，请你立即停止注册及使用回响树洞所提供的全部服务。
            1、接受条款
            1.1 回响树洞的运营者根据本使用协议的条款及不时发布的规则为你提供基于回响树洞关于客户端的互联网服务。本协议的条款可由回响树洞随时修改，修改后的使用协议在网站上一经公布即有效代替原来的使用协议。你一旦在回响树洞注册，即成为回响树洞用户（以下简称“用户”或“你”），并受本协议的约束。
            1.2 当你使用回响树洞单项服务时，你和回响树洞应遵守回响树洞随时公布的与该服务相关的指引和规则。前述所有的指引和规则，均构成本使用协议的一部分。
            1.3 你应遵守本协议的各项条款，合法合理使用回响树洞提供的服务，否则，回响树洞有权依据本协议中断或终止为你提供服务。同时，回响树洞保留在任何时候收回你所使用的账号的权利。
            2、服务说明
            2.1 回响树洞向用户提供包括但不限于如下服务：发布动态、记录日记、上传图片视频、发布或参加各类活动、制作个性化日历、制作个性化日记串等。除非本协议另有其它明示规定，回响树洞增加或强化目前本服务的任何新功能，包括所推出的新产品，均受本使用协议之规范。
            2.2 用户了解并同意，回响树洞之服务、产品与资料仅依其当前所呈现的状况提供，而且回响树洞明确地表示拒绝对于“服务”、“资料”或“产品”等给予任何明示或暗示之担保或保证，包括但不限于，为商业使用、适合于特定目的或未侵害他人权利之担保或保证等。回响树洞对于因“服务”、 “产品”或“资料”等所产生之任何直接、间接、附带的或因此而导致之衍生性损失概不负责。回响树洞对于任何用户信息或个性化设定之时效、删除、传递错误、未予储存或其它任何问题，均不承担任何责任。
            2.3 你同意回响树洞有权制订关于使用本服务的一般措施及限制，包括但不限于本服务将保留所发布内容或其它发布内容之最长期间，以及一定期间内你使用本服务之次数上限（及/或每次使用时间之上限）。通过本服务发布或传送之任何信息、通讯资料和其它内容，如被删除或未予储存，你同意回响树洞无须承担任何责任。你也同意，回响树洞有权依其自行之考虑，不论通知与否，随时变更这些一般措施及限制。
            3、你的注册义务
            3.1 你须对在回响树洞的注册信息的真实性、合法性、有效性承担全部责任，你不得冒充他人（包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设账号；不得利用他人的名义发布任何信息；不得恶意使用注册帐户导致其他用户误认；否则回响树洞有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。若你提供任何违法、不道德或回响树洞认为不适合在回响树洞上展示的资料；或者回响树洞有理由怀疑你的行为属于程序或恶意操作，回响树洞有权无须事先通知即可暂停或终止你使用账号，并拒绝你于现在和未来使用本服务之全部或任何部分。
            3.2 回响树洞无须对你（任何用户）的任何注册或登记资料承担任何责任，包括但不限于鉴别、核实任何注册或登记资料的真实性、正确性、完整性、适用性及/或是否为最新资料的责任。
            4、用户账号、密码及安全
            4.1 完成本服务的注册程序并成功注册之后，你可使用你的注册手机号码和密码，登录到你在回响树洞的账号（下称“账号”）。注册完成之时，你便获得了账号的使用权。保护账号安全，是你的责任。
            4.2 你应对所有使用你的账号的行为负完全的责任。你同意：
            1）你的回响树洞账号遭到未获授权的使用，或者发生其它任何安全问题时，你将立即通知回响树洞；
            2）如果你未保管好自己的账号和密码，因此而产生的任何损失或损害，回响树洞不承担任何责任；
            3）你要对使用账号的所有行为给你、回响树洞或第三方造成的损害负全责，包括你未保管好自己的账号或密码的情形。
            4.3 由于通过账号可获取到用户的个人信息，且账号的所有权归回响树洞所有，除法律明文规定外，未经岁岁同意，用户不得将账号转让、出售或出借给他人使用。
                        
            5、用户个人信息保护
            5.1 保护你个人信息安全既是法律要求，也是回响树洞长期坚持的一项基本原则。你提供的注册资料及回响树洞保留的有关你的其它资料将受到中国有关法律的保护。5.2 一般情况下，你可随时浏览、修改你在回响树洞上的信息，但出于安全性和身份识别的考虑，你可能无法修改注册时提供的初始注册信息及其他验证信息。
            6、提供者之责任
            6.1 根据有关法律法规，回响树洞在此郑重提请你注意，任何经由本服务而发布、上传的文字、音乐、图片、图形、视频或其他资料（以下简称“内容 ”），无论系公开还是非公开传送，均由内容提供者承担责任。回响树洞仅为用户提供信息存储空间服务，无法控制经由本服务传送之内容，因此不保证内容的正确性、完整性或有效性。你已预知使用本服务时，可能会接触到令人不快、不适当或令人厌恶之内容。在任何情况下，回响树洞均不为任何内容负责，但回响树洞有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用本服务的全部或部分，保存有关记录，并向有关机关报告等。
            6.2 你明确了解并同意，基于以下原因而造成的，包括但不限于经济、信誉、数据损失或其他无形损失，回响树洞不承担任何直接、间接、附带、特别、衍生性或惩罚性赔偿责任：
            1）本服务之使用或无法使用；
            2）为替换从或通过本服务购买或取得之任何商品、数据、信息、服务，收到的讯息，或与第三方缔结交易而发生的成本；
            3）你的传输或数据遭到未获授权的存取或改变；
            4）任何第三方在本服务中所作之声明或行为；
            5）第三方以任何方式发布或投递欺诈性信息，或诱导用户受到经济损失；
            6）与本服务相关的其他事宜，但本使用协议有明确规定的除外。
            7、服务变更、中断或终止
            7.1 回响树洞可能会对服务内容进行变更、也可能会中断、终止服务。
            7.2 鉴于网络服务的特殊性（包括但不限于服务器的稳定性问题、恶意的网络攻击等行为或回响树洞无法控制的情形），你同意回响树洞有权随时中断或终止部分或全部的服务。
            7.3 你理解，回响树洞需要定期或不定期对提供服务的平台或相关设备进行维护、升级或其他目的暂停部分或全部服务，如因此类情况而造成服务在合理时间内的中断，回响树洞无需为此承担任何责任。
            7.4 若你违反法律、政策或违反本使用协议，回响树洞有权随时中断或终止向你提供本协议项下的服务而无需对你或任何第三方承担责任。
            7.5 你同意回响树洞基于其自行之考虑，因任何理由，包含但不限于缺乏使用，或回响树洞认为你已经违反本使用协议，终止你的账号或本服务之使用（或服务之任何部分），并将你在本服务内任何内容加以移除并删除。你同意依本使用协议任何规定提供之服务，无需进行事先通知即可中断或终止。你承认并同意，回响树洞可立即关闭或注销你的账号及删除你账号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，你同意若本服务之使用被中断或终止或你的账号及相关信息和文件被关闭或注销，回响树洞对你或任何第三人均不承担任何责任。
            8、担保与保证
            你明确了解并同意∶
            1）本使用协议的任何规定不会免除回响树洞因过错而造成你人身伤害或财产损失的任何责任；
            2）回响树洞不保证以下事项∶
            · 本服务将符合你的要求；
            · 本服务将不受干扰、及时提供、安全可靠或不会出错；
            · 使用本服务取得之结果正确可靠；
            · 你经由本服务购买或取得之任何产品、服务、资讯或其它信息将符合你的期望；
            3）你自回响树洞或经由本服务取得的任何建议或信息，无论是书面或口头形式，除非本使用协议有明确规定，将不构成本使用协议以外之任何保证。
            9、用户行为
            9.1 你应遵守中华人民共和国相关法律法规，并同意对以任何方式使用你的登录账号而使用本服务的任何行为及其结果承担全部责任。如你的行为违反国家法律，你将依法承担全部法律责任；如涉嫌构成犯罪，司法机关将追究你的刑事责任，回响树洞将严格按照法律规定的义务及司法机关的要求进行配合。
            同时，如果回响树洞有理由认为你的任何行为，包括但不限于你的任何言论或其它行为违反或可能违反国家法律法规的任何规定，回响树洞可在任何时候不经任何事先通知终止向你提供服务。
            9.2 你同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶
            1）发布或以其他方式传送含有下列内容之一的信息：
            · 反对宪法所确定的基本原则的；
            · 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            · 损害国家荣誉和利益的；
            · 煽动民族仇恨、民族歧视、破坏民族团结的；
            · 破坏国家宗教政策，宣扬邪教和封建迷信的；
            · 散布谣言，扰乱社会秩序，破坏社会稳定的；
            · 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            · 侮辱或者诽谤他人，侵害他人合法权利的；
            · 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其他道德上令人反感的内容；
            · 含有中国法律、法规、（部门）规章以及任何具有法律效力之规范所限制或禁止的其他内容的；
            · 含有回响树洞认为不适合在回响树洞展示的内容；
            2）以任何方式危害他人的合法权益；
            3）冒充其他任何人或机构，或以虚伪不实的方式陈述或谎称与任何人或机构有关；
            4）将依据任何法律、合约或法定关系（例如由于雇佣关系和依据保密合约所得知或揭露之内部资料、专属及机密资料）而知悉但无权传送之任何内容加以发布、发送电子邮件或以其它方式传送；
            5）将侵害他人著作权、专利权、商标权、商业秘密、或其他专属权利（以下简称“专属权利”）之内容加以发布或以其他方式传送；
            6）将任何“广告信函”、“促销资料”、“垃圾信件”、“滥发信件”、“连锁信件”、“直销”或其他任何形式的劝诱资料加以发布、发送或以其它方式传送；
            7）将设计目的在于干扰、破坏或限制任何计算机软件、硬件或通讯设备功能之计算机病毒（包括但不限于木马程序（trojan horses）、蠕虫（worms）、定时炸弹、删除蝇（cancelbots）（以下简称“病毒”）或其他计算机代码、档案和程序之任何资料，加以发布、发送或以其他方式传送；
            8）干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；
            9）跟踪、人肉搜索或以其他方式骚扰他人；
            10）故意或非故意地违反任何适用的当地、国家法律，以及任何具有法律效力的规则；
            11）未经合法授权而截获、篡改、收集、储存或删除你或他人的个人信息、或其他数据资料，或将获知的此类资料用于任何非法或不正当目的。
            你已认可回响树洞未对用户的使用行为进行全面控制，你使用任何内容时，包括依赖前述内容之正确性、完整性或有效性时，你同意将自行加以判断并承担所有风险，而不依赖于回响树洞。但回响树洞依其自行之考虑，有权拒绝和删除经由本服务提供之违反本条款的或其他引起回响树洞反感的任何内容。
            10、知识产权
            10.1 回响树洞在本服务中提供的内容（包括但不限于网页、界面设计、版面框架、文字、音频、视频、图片或其他资料等）等知识产权归回响树洞或相关权利人所有。除另有约定外，回响树洞提供本服务时所依托的软件、系统等的著作权、专利权及其他知识产权归回响树洞所有。回响树洞以及其他回响树洞标识及产品、服务名称，均为回响树洞之商标。未经回响树洞事先书面同意，你不得擅自删除、掩盖或更改回响树洞的版权声明、商标或其它权利声明，不得将回响树洞的商标以任何方式展示或使用或作其它处理，或表示你有权展示、使用或另行处理回响树洞的商标。
            10.2 你在回响树洞上传或发布的内容，应保证为其著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。点击同意本协议，即表明你同意授予回响树洞所有上述内容的非独家使用权许可，据该许可回响树洞将有权以展示、推广等不为我国法律所禁止的方式使用前述内容。同时你同意许可回响树洞视具体情况就任何主体侵犯你权益的事宜进行维权，包括但不限于发送维权函件、提起诉讼、申请仲裁等，其效力及于用户在回响树洞发布的任何受著作权法保护的内容，你也可以授权其他第三方为你维权，且可以随时终止对回响树洞的授权。
            10.3 你有权将你在回响树洞上发布的内容授权给他人使用。回响树洞欢迎你优先选择回响树洞就相关内容进行合作。
            10.4 你了解并同意，本服务及本服务所使用之相关软件含有受到相关知识产权及其他法律保护之专有保密资料。你也了解并同意，经由本服务或广告商向你呈现之赞助广告或信息所包含之内容，亦受到著作权、商标权、专利权或其他专属权利之法律保护。未经回响树洞或广告商明示授权，你不得修改、出租、出借、出售、散布本服务或软件之任何部分或全部，或据以制作衍生著作，或使用擅自修改后的软件等。回响树洞仅授予你个人、不可移转及非专属之使用权，使你得于在单机计算机上使用其软件之目的，但你不得（且不得允许任何第三人）复制、修改、改编、翻译、创作衍生著作、进行还原工程、反向组译、传播或以其它方式发现原始码，或出售、转让、再授权或提供软件设定担保，或以其它方式移转软件之任何权利。你同意将通过由回响树洞所提供的界面而非任何其它途径使用本服务。
            10.5 如你违反世界版权公约、中华人民共和国著作权法、商标法、专利法、反不正当竞争法及其他与知识产权方面相关的法律法规或本协议约定，你应自行承担因此而给他人（包括回响树洞）造成的损害，承担相应的法律责任。
            11、用户专属权利
            11.1 回响树洞尊重他人合法权益（包括知识产权、名誉权、商誉权等），呼吁你也尊重他人合法权益。
            11.2 如果你违反法律法规的禁止性规定、对他人的合法权益或公众利益造成了侵害，回响树洞将依国家法律法规的规定，或在适当的情形下，依本协议或其相关规定，删除特定内容或以至终止你对账户的使用。
                        
            12、国际使用之特别告知
            你已了解互联网的无国界性，同意遵守当地所有关于网上行为及内容之法律法规。你特别同意遵守有关从中国或你所在国家或地区输出信息之传输的所有适用法律法规。
            13、未成年人使用条款
            如你是未成年用户，请在法定监护人的陪同下仔细阅读本使用协议，你及法定监护人应按照法律及本协议规定承担责任。
            """;
    public static final String  CHANGE_PASSWORD_SUCCESS = "修改密码成功！请重新登录！";
    public static final String CHANGE_PASSWORD_FAILED = "修改密码失败！请检查旧密码是否正确！";
    public static final String LOGOUT_SUCCEED = "登出成功！";
    public static final String CHANGE_USERINFO_SUCCESS = "设置用户信息成功！";
    public static final String NICKNAME_EXIST = "昵称已存在！";
    public static final String CREATE_JOURNAL_FAILED = "发生错误！创建日记失败！";
    public static final String MODIFY_JOURNAL_FAILED = "修改日记失败！";
    public static final String CREATE_JOURNAL_SUCCESS = "创建日记成功！";
    public static final String MODIFY_JOURNAL_SUCCESS = "修改日记成功！";
    public static final String DELETE_JOURNAL_FAILED = "删除日记失败！";
    public static final String DELETE_JOURNAL_SUCCESS = "删除日记成功！";
    public static final String GET_USERINFO_FAILED = "获取用户信息失败！";
    public static final String GET_JOURNALS_FAILED = "获取日记失败！";
    public static final String SET_TOPJOURNAL_FAILED = "设置置顶属性失败！";
    public static final String SET_TOPJOURNAL_SUCCESS = "设置置顶属性成功！";
    public static final String CREATE_JOURNAL_GROUP_SUCCESS = "创建日记串成功！";
    public static final String CREATE_JOURNAL_GROUP_FAILED = "创建日记串失败！";
    public static final String GET_JOURNALGROUPS_FAILED = "获取日记串失败！";
    public static final String CHANGE_JGNAME_SUCCESS = "修改日记串名字成功！";
    public static final String CHANGE_JGNAME_FAILED = "修改日记串名字失败！";
    public static final String ADD_JOURNAL_SUCCESS = "添加日记成功！";
    public static final String GET_JOURNALGROUP_FAILED = "获取指定日记串失败！";
    public static final String ADD_JOURNAL_FAILED = "要添加的日记或日记串不存在！";
    public static final String ADD_JOURNAL_FAILED_EXIST = "要添加的日记已经在该日记串中！";
    public static final String JOURNAL_GROUP_MATCH_FAILED = "日记串不存在！";
    public static final String DELETE_JOURNAL_GROUP_SUCCESS = "删除日记串成功！";
    public static final String DELETE_JOURNAL_GROUP_FAILED = "日记串中还有日记！删除日记串失败！";
    public static final String DELETE_JOURNAL_GROUP_ERROR = "出现错误，删除日记串失败！";
    public static final String DELETE_JOURNAL_FROM_JG_SUCCESS = "从日记串删除日记成功！";
    public static final String DELETE_JOURNAL_FROM_JG_FAILED_NO_EXIST = "日记串或日记不存在！";
    public static final String DELETE_JOURNAL_FROM_JG_MATCH_FAILED = "该日记不在此日记串中！";
    public static final String DELETE_JOURNAL_FROM_ERROR = "从日记串移除日记失败！";
    public static final String NOT_KNOWN_ERROR = "出现未知错误！请联系管理员！";
    public static final String NO_JOURNAL_FOUND = "未发现日记！";
    public static final String EMPTY_DATA = "未设置";
    public static final String REGISTER_ERROR = "注册失败！";
    public static final String COMMON_ERROR = "操作失败！请检查传递参数！";
}

